Dlubal.RFEM5.Rib
Rib parameters

Dlubal.RFEM5.Rib.No
Number

Dlubal.RFEM5.Rib.ID
Identifier

Dlubal.RFEM5.Rib.Comment
Comment

Dlubal.RFEM5.Rib.Tag
Tag

Dlubal.RFEM5.Rib.IsValid
Information if the object is valid or not (read only)

Dlubal.RFEM5.Rib.Position
Rib position

Dlubal.RFEM5.Rib.SurfaceNoSide1
Connecting surface No. on the side 1

Dlubal.RFEM5.Rib.WidthSide1
Integration width on the side 1

Dlubal.RFEM5.Rib.SurfaceNoSide2
Connecting surface No. surface on the side 2

Dlubal.RFEM5.Rib.WidthSide2
Integration width on the side 2

Dlubal.RFEM5.Rib.AlignLocalZAxis
Align local z-axis parallel to local z-axis of surface